{
  "id": "2",
  "name": "NodeDataQualityCheckAndAlert",
  "description": "",
  "type": "transform",
  "nodeClass": "fire.nodes.quality.NodeDataQualityCheckAndAlert",
  "fields" : [
    {"name": "emailAddress", "value":"", "widget": "textfield", "title": "Email Address", "description": "Email Address. Add multiple email in comma separated", "expandable":true},
    {"name":"subject", "display": true, "value":"", "widget": "textfield", "title": "Subject", "description": "Subject" ,"required":"false", "expandable":true},
    {"name": "threshold", "value":"", "widget": "textfield","title": "Threshold", "description": "Threshold"},
    {"name":"dataQualityResultPath", "display":true,"value":"", "widget": "textfield", "required":true, "title": "Result Path", "description": "Path of the good and bad records"}
  ]
}

start-details:

h2: NodeDataQualityCheckAndAlert

h4: Overview:

This node is used to perform data quality checks on a DataFrame and send alerts based on the results. It allows you to define various checks, such as:

Missing values: Checks for null or empty values in columns.
Invalid data types: Ensures that data in each column conforms to the expected data type.
Outliers: Identifies values that deviate significantly from the norm.
Duplicate values: Detects duplicate records.
Custom checks: Allows you to define custom checks using expressions.

h4: Input:

Email Address: The email address to send alerts to.
Threshold: The percentage of records that must fail a check to trigger an alert.
Result Path: The path to save the detailed report of the data quality checks.
h4: Output:

The node will send an email alert if the threshold is exceeded and save a detailed report of the checks to the specified path.

end-details:

start-examples:

Example:

Let's say you want to check for missing values and invalid data types in a DataFrame.

Configure the Node:

Email Address: [email address removed]
Threshold: 10 (10% of records must fail)
Result Path: /path/to/report.csv
Node Execution:

The node will check for missing values and invalid data types in each column.
If more than 10% of records fail any check, an email alert will be sent.
A detailed report of the checks will be saved to the specified path.

end-examples:
