{
  "id": 2986,
  "uuid": "56b12101-2682-48ec-bda2-085291b3c5b5",
  "name": "1.Overview",
  "category": "",
  "projectId": 4176,
  "content": "<h1><strong>Torque Tube Logistics Optimization</strong></h1><p><br></p><h2><strong>Objective</strong></h2><p>This project aims to build a data-driven solution for optimizing torque tube supplier planning across North American projects. The objective is to reduce landed costs, support strategic sourcing decisions, and streamline planning by replacing manual supplier forecast allocations with a scalable, automated system.</p><p><br></p><h2><strong>Approach</strong></h2><p>The solution involves creating a planning accelerator that ingests supplier data, demand , sourcing guidelines, and logistics parameters to recommend optimal allocation strategies.</p><p>Key focus areas include:</p><ul><li><strong>Sourcing Intelligence</strong>: Integrating supplier capabilities, commercial terms, and qualification status</li><li><strong>Logistics Optimization</strong>: Modeling transportation cost and constraints based on packaging specs and routing rules</li><li><strong>Business Rules Compliance</strong>: Enforcing sourcing guidelines such as minimum commitments and domestic content targets</li></ul><p>The final system will be configurable for regional priorities, constraints, and what-if scenario modeling.</p><p><br></p><h2><strong>Significance</strong></h2><ul><li><strong>Cost Optimization</strong>: Helps identify allocation scenarios that minimize total cost (material + conversion + logistics)</li><li><strong>Time Savings</strong>: Reduces manual planning effort by producing reliable supplier forecasts</li><li><strong>Sourcing Compliance</strong>: Enforces policy constraints in supplier selection and allocations</li><li><strong>Scalability</strong>: Designed to scale beyond torque tubes and US scope into other commodities and regions</li></ul><p><br></p><h2><strong>Expected Outcomes</strong></h2><ul><li>Accurate, actionable weekly supplier plans</li><li>Reduction in landed logistics and material costs</li><li>Clear visibility into allocation drivers and trade-offs</li></ul>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "Mar 26, 2025, 5:49:18 PM",
  "updatedBy": "admin",
  "dateLastUpdated": "Apr 30, 2025, 5:30:40 AM"
}