{
  "id": 3246,
  "uuid": "b27d87d1-6e93-412d-ba0b-8f66422f2f34",
  "name": "01-Project Overview",
  "category": "",
  "projectId": 2449,
  "content": "<h1>Telco BTS Risk Management Analytical App</h1><h2>Project Overview</h2><p><strong>Objective:</strong></p><p><strong class=\"ql-size-large\"> The BTS Risk Management project aims to evaluate and predict the risk associated with deploying </strong><strong>Base Transceiver Stations (BTS)</strong> across different cities in the USA. By analyzing audit, financial, and historical performance scores, the app helps telecom operators <strong>assess site viability</strong>, identify high-risk regions, and make informed infrastructure investment decisions.</p><p><strong>Approach:</strong></p><p><strong class=\"ql-size-large\"> The solution applies a complete data science workflow:</strong></p><ol><li><strong>Data Profiling &amp; Quality Checks</strong> – Assess the dataset for missing values and inconsistencies.</li><li><strong>Exploratory Data Analysis (EDA)</strong> – Identify patterns and relationships between audit scores, financial scores, and BTS deployment risks.</li><li><strong>Feature Engineering</strong> – Combine audit and performance metrics to derive location-level risk indicators.</li><li><strong>Model Training</strong> – Use a <strong>Gradient Boosting Classifier</strong> to predict BTS risk probability.</li><li><strong>Prediction &amp; Validation</strong> – Classify BTS deployments as <strong>Risky (1)</strong> or <strong>Not Risky (0)</strong> with performance evaluation.</li><li><strong>Predictive Insights</strong> – Highlight top 5 high-risk and low-risk cities, along with feature contributions.</li></ol><p><strong>Significance:</strong></p><p><strong class=\"ql-size-large\"> Deploying BTS infrastructure involves </strong><strong>high capital expenditure</strong> and <strong>long-term operational commitments</strong>. Incorrect site selection or failure to identify risk factors can lead to:</p><ul><li>Service outages.</li><li>Regulatory penalties.</li><li>Increased costs and delays.</li></ul><p>By using predictive modeling, telecom providers can <strong>reduce deployment risk</strong>, improve <strong>decision-making efficiency</strong>, and ensure <strong>sustainable infrastructure growth</strong>.</p><p><strong>Benefits:</strong></p><ul><li><strong>Cost Avoidance:</strong> Prevents financial losses from risky deployments.</li><li><strong>Efficient Resource Allocation:</strong> Directs investment toward low-risk, high-potential locations.</li><li><strong>Enhanced Planning:</strong> Provides early warnings for cities likely to underperform.</li><li><strong>Risk Transparency:</strong> Offers clear visibility into the drivers of BTS risk.</li><li><strong>Improved Reliability:</strong> Ensures better connectivity and customer satisfaction through stable deployments.</li></ul><p><strong>Expected Outcomes:</strong></p><ul><li>A predictive model capable of classifying BTS deployments into <strong>risk categories</strong>.</li><li>Analytical dashboards visualizing <strong>BTS installation distribution</strong> and <strong>regional risk maps</strong>.</li><li>Ranked lists of top <strong>5 high-risk</strong> and <strong>5 low-risk</strong> cities for decision-making.</li></ul><p class=\"ql-align-justify\"><br></p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "Aug 2, 2025, 12:08:29 PM",
  "updatedBy": "abhilash",
  "dateLastUpdated": "Sep 19, 2025, 2:33:17 AM"
}