{
  "id": 2222,
  "uuid": "81392ab9-a798-45f7-8e1d-255d10c564fa",
  "name": "0-Introduction",
  "category": "",
  "projectId": 1645,
  "content": "<h1>Project Overview</h1><p><br></p><h2>Business Context</h2><p>In real estate and property management, timely maintenance of infrastructure is crucial to ensure tenant satisfaction, operational efficiency, and asset longevity. Unplanned maintenance activities often lead to higher costs, service disruptions, and potential safety risks. With the integration of IoT sensors and digital monitoring systems, large-scale property management firms are now capturing high volumes of data related to building performance indicators such as water pressure, smoke levels, elevator vibrations, HVAC temperature, and power usage.</p><p>This wealth of data offers an opportunity to proactively manage maintenance activities using data-driven approaches, reducing unplanned downtimes and optimizing resource allocation.</p><p><br></p><h2>Business Problem</h2><p>Despite data availability, maintenance decisions in many property portfolios are still reactive, leading to increased costs and operational inefficiencies. The challenge lies in accurately predicting maintenance needs before failures occur. Without predictive insights, properties are either over-maintained (wasting resources) or under-maintained (increasing the risk of breakdowns).</p><p>Key questions facing property operations teams include:</p><ul><li>Which properties are most at risk of requiring maintenance?</li><li>What are the key drivers of maintenance needs?</li><li>How accurate are the existing predictive models?</li></ul><p><br></p><h2>Solution</h2><p>A machine learning-based predictive model was developed to estimate the likelihood of maintenance requirements across properties using historical sensor and operational data. The solution includes:</p><ul><li><strong>Feature importance and correlation analysis</strong> to understand key indicators influencing maintenance.</li><li><strong>Predictive modeling and evaluation</strong> using confusion matrix, AUC, PRAUC and error metrics to assess model reliability.</li><li><strong>Risk trend monitoring</strong> over time to identify properties with rising maintenance risk.</li><li><strong>Error analysis</strong> to break down false positives and false negatives for further refinement.</li></ul><p>The predictive insights generated by this solution enable property managers to:</p><ul><li>Prioritize proactive maintenance actions.</li><li>Reduce costs by targeting at-risk properties.</li><li>Improve asset reliability and occupant satisfaction.</li></ul><p><br></p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/wiki_icon.svg\"}",
  "description": "A predictive maintenance solution was developed to transform reactive property management into a data-driven, proactive maintenance strategy.",
  "syncedWithGithub": false,
  "createdBy": "saju",
  "dateCreated": "May 8, 2025, 7:08:10 AM",
  "dateLastUpdated": "May 8, 2025, 7:08:10 AM"
}