{
  "id": 2221,
  "uuid": "44d05fc9-5c7e-4eab-812d-beee39591c37",
  "name": "1-Dataset",
  "category": "",
  "projectId": 1645,
  "content": "<h3><strong>Maintenance Based on Sensor Thresholds</strong></h3><p><br></p><h4><strong>Overview</strong></h4><p><br></p><p>The dataset is designed for the development of predictive maintenance models in a facilities management context. It captures sensor-driven operational data from various building systems across multiple properties. The core objective is to use these sensor readings to anticipate maintenance needs, thereby minimizing downtime, improving operational efficiency, and enhancing safety compliance.</p><h4><br></h4><h4><strong>Dataset Summary</strong></h4><p><br></p><p>The dataset comprises 2,400 records, each representing sensor readings collected at different time points from several properties. It contains a combination of numerical sensor data and categorical identifiers, along with a binary target variable indicating whether maintenance was required. This structured data is well-suited for supervised machine learning applications aimed at predicting maintenance events.</p><h4><br></h4><h4><strong>Features</strong></h4><ul><li><strong>Property_ID</strong>: A unique identifier representing each property monitored for maintenance.</li><li><strong>Timestamp</strong>: A datetime field marking when the sensor readings were captured.</li><li><strong>HVAC_Temp</strong>: Records the temperature output from the HVAC system, indicative of heating/cooling performance.</li><li><strong>Water_Pressure</strong>: Measures the water pressure levels in the plumbing system, critical for leak detection and flow regulation.</li><li><strong>Power_Usage</strong>: Reflects the energy consumption at the property, potentially identifying overloads or inefficiencies.</li><li><strong>Elevator_Vibration</strong>: Captures vibration levels in the elevator system, which may signal mechanical faults or wear.</li><li><strong>Smoke_Level</strong>: Indicates the concentration of smoke detected, useful for identifying fire or air quality issues.</li><li><strong>Maintenance_Type</strong>: Specifies the category of maintenance conducted, if any (used as a reference field).</li><li><strong>Maintenance_Required</strong>: The target binary variable indicating whether maintenance was needed (1) or not (0).</li></ul><h4><br></h4><h4><strong>Target Variable</strong></h4><p><br></p><p>The target variable is a binary indicator denoting maintenance necessity. A value of one signals that maintenance was required, while a zero indicates normal operations without intervention. This classification allows for straightforward application of binary classification models to identify risk-prone operational states.</p><h4><br></h4>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/wiki_icon.svg\"}",
  "description": "A structured dataset of 2,400 sensor-based records was used to model and predict maintenance needs across multiple properties.",
  "syncedWithGithub": false,
  "createdBy": "saju",
  "dateCreated": "May 8, 2025, 7:08:10 AM",
  "dateLastUpdated": "May 8, 2025, 7:08:10 AM"
}