{
  "id": 2223,
  "uuid": "cd7544f2-be6d-4d74-a008-e0925e13469f",
  "name": "2-Feature used in model building",
  "category": "",
  "projectId": 1645,
  "content": "<h2><strong>Feature Used in Model Building</strong></h2><p><br></p><p>This section outlines the key sensor-based features incorporated in the predictive maintenance model. Each variable represents a specific operational dimension within the building infrastructure and plays a vital role in identifying potential maintenance requirements.</p><p><strong>HVAC_Temp</strong></p><ul><li> Records the temperature output from the HVAC system, serving as an indicator of the heating and cooling performance. Abnormal values may highlight issues in climate control or thermal regulation systems.</li></ul><p><strong>Water_Pressure</strong></p><ul><li> Measures the water pressure within the plumbing network. Consistent or extreme deviations in pressure levels can be early indicators of leaks, blockages, or pump malfunctions.</li></ul><p><strong>Power_Usage</strong></p><ul><li> Reflects the total energy consumption across the facility. Elevated or fluctuating readings may suggest inefficiencies, equipment overload, or energy distribution problems.</li></ul><p><strong>Elevator_Vibration</strong></p><ul><li> Captures the intensity of vibrations in the elevator system. Increased vibration patterns often signify mechanical wear, component misalignment, or impending system failures.</li></ul><p><strong>Smoke_Level</strong></p><ul><li> Indicates the concentration of smoke particles in the monitored area. This is a critical feature for detecting fire risks or deteriorating air quality, both of which require prompt attention.</li></ul><p><br></p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/wiki_icon.svg\"}",
  "description": "The features used in model building represent critical sensor readings that monitor environmental conditions, equipment performance, and utility usage to predict maintenance needs.",
  "syncedWithGithub": false,
  "createdBy": "saju",
  "dateCreated": "May 8, 2025, 7:08:10 AM",
  "dateLastUpdated": "May 8, 2025, 7:08:10 AM"
}