{
  "id": 2220,
  "uuid": "64dd9cc6-f26e-4295-a2a7-54b8c92af437",
  "name": "3-Model Performance Summary",
  "category": "",
  "projectId": 1645,
  "content": "<h3><strong>Predictive Maintenance Model</strong></h3><h4><strong>Overview</strong></h4><p>The predictive maintenance model was developed to forecast whether a property will require maintenance based on sensor data. The model uses features such as HVAC temperature, water pressure, power usage, elevator vibration, and smoke levels to predict the binary outcome of maintenance necessity. By leveraging machine learning techniques, the system helps in minimizing downtime and improving resource planning.</p><p><br></p><h4><strong>Predictive Analytics Insights</strong></h4><p>The model was applied across multiple properties and evaluated based on predicted vs. actual maintenance outcomes. The analysis included:</p><ul><li><strong>Property-wise comparison</strong> of actual vs predicted maintenance events to assess alignment.</li><li><strong>Risk score monitoring</strong> to track changes in maintenance probability over time.</li><li><strong>Error categorization</strong> distinguishing between false positives, false negatives, and true negatives for each property.</li></ul><p>These insights enabled the identification of properties with increasing risk trends and model misclassifications that require closer inspection.</p><p><br></p><h4><strong>Feature Importance</strong></h4><p>The most influential feature in predicting maintenance was <strong>Smoke_Level</strong>, contributing over 60% to the model's decision-making. <strong>Water_Pressure</strong> and <strong>Elevator_Vibration</strong> also played significant roles, while <strong>HVAC_Temp</strong> and <strong>Power_Usage</strong> had minimal impact. This insight helps in prioritizing sensor calibration and monitoring investments.</p><p><br></p><h4><strong>Model Performance Metrics</strong></h4><p>Key training and validation metrics used to evaluate model performance include:</p><ul><li><strong>Accuracy</strong>: 92% — indicating the model correctly predicted most cases.</li><li><strong>Precision</strong>: 84% — showing high reliability in true positive predictions.</li><li><strong>Recall</strong>: 86% — reflecting the model’s ability to detect actual maintenance cases.</li><li><strong>F1 Score</strong>: 85% — a balanced metric combining precision and recall.</li><li><strong>AUC (Area Under ROC Curve)</strong>: 0.97 — demonstrating excellent model discrimination capability.</li><li><strong>PR AUC</strong>: 0.94 — indicating strong precision-recall tradeoff, especially important for imbalanced datasets.</li><li><strong>MSE (Mean Squared Error)</strong>: 0.081</li><li><strong>R² Score</strong>: 0.82 — showing good model fit for regression-based evaluation.</li></ul><p>These metrics confirm that the model is both accurate and robust in its predictions.</p><p><br></p><h4><strong>Confusion Matrix Analysis</strong></h4><p>The confusion matrix revealed the following outcomes:</p><ul><li><strong>True Positives (TP)</strong>: Cases where maintenance was correctly predicted.</li><li><strong>True Negatives (TN)</strong>: Non-maintenance cases correctly classified.</li><li><strong>False Positives (FP)</strong>: Instances where maintenance was predicted but not required.</li><li><strong>False Negatives (FN)</strong>: Missed predictions where maintenance was required but not identified.</li></ul><p>The relatively low number of false negatives indicates the model is effective at minimizing missed maintenance risks, which is critical in operational environments.</p><p><br></p><h4><strong>Conclusion</strong></h4><p>The model provides a reliable, data-driven approach to anticipate property maintenance needs. With strong performance metrics and interpretable feature importance, it supports proactive decision-making and enhances operational efficiency. Ongoing refinement can focus on reducing false positives and incorporating temporal patterns for improved forecasting.</p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/wiki_icon.svg\"}",
  "description": "A machine learning model achieved high accuracy and interpretability in predicting maintenance requirements using key sensor inputs like smoke levels and water pressure.",
  "syncedWithGithub": false,
  "createdBy": "saju",
  "dateCreated": "May 8, 2025, 7:08:10 AM",
  "dateLastUpdated": "May 8, 2025, 7:08:10 AM"
}