{
  "id": 3834,
  "uuid": "155e338b-4b91-4398-9cfc-3899bc3a2666",
  "name": "01-Overview",
  "category": "",
  "projectId": 2662,
  "content": "<h1>Supplier Selection </h1><h1><br></h1><h2>I. Project Overview</h2><h3><br></h3><h3> Objective</h3><p>The primary goal of this project is to develop a data-driven supplier evaluation and selection system. Businesses rely heavily on suppliers for raw materials, parts, and timely order fulfillment. Poor supplier choices can lead to delays, increased costs, and reduced customer satisfaction.</p><p> This project addresses the question:</p><p> “Which suppliers consistently demonstrate high performance across cost, quality, reliability, and service metrics?”</p><h3><br></h3><h3> Approach</h3><p>The project follows a structured data science workflow:</p><ol><li>Data Integration – Combine supplier, parts, and order datasets.</li><li>Data Profiling – Assess data quality and consistency.</li><li>Data Preparation – Handle missing values, normalize features, and engineer new performance indicators.</li><li>Exploratory Data Analysis (EDA) – Identify trends, outliers, and patterns in supplier performance.</li><li>Model Training – Build a machine learning model (classification) to predict whether a supplier is “good” or “poor.”</li><li>Model Evaluation – Use appropriate metrics to assess accuracy and robustness.</li><li>Supplier Scoring – Generate supplier rankings and insights to support strategic sourcing decisions.</li></ol><h3><br></h3><h3>Significance</h3><p>Supplier selection directly affects cost control, operational efficiency, and customer satisfaction. By using analytics and machine learning, businesses can transition from subjective decision-making to evidence-based supplier management.</p><h3><br></h3><h3>Benefits</h3><ul><li>Financial: Optimize sourcing decisions to reduce procurement costs.</li><li>Operational: Improve supply chain resilience and reduce delays.</li><li>Strategic: Enable consistent evaluation of new and existing suppliers.</li><li>Customer Experience: Ensure high-quality products and reliable delivery timelines.</li></ul><h3><br></h3><h3>Expected Outcomes</h3><ul><li>A predictive model that classifies suppliers into performance tiers (e.g., Good vs. Poor).</li><li>Supplier performance dashboards highlighting key metrics.</li><li>Supplier ranking system based on weighted evaluation criteria.</li><li>Actionable recommendations for procurement teams.</li><li><br></li></ul>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "rohan",
  "dateCreated": "Aug 25, 2025, 7:01:28 AM",
  "updatedBy": "mudit",
  "dateLastUpdated": "Sep 12, 2025, 6:46:59 AM"
}