{
  "id": "5",
  "name": "Feature Selection With Importance",
  "description": "",
  "input" : "",
  "output": "Pass the input DataFrame to output and in table format feature importance is displayed.",
  "type": "transform",

  "nodeClass": "fire.nodes.featureselection.NodeFeatureSelectionWithImportance",
  "fields" : [

    {"name":"targetCol", "value": "", "widget": "variable", "title": "TargetCol", "description": "Target column to be used when selecting the features", "required": true},

    {"name": "featureCols", "value":"[]", "widget": "variables", "title": "Feature Columns", "description": "The list of columns for which to calculate the feature importance", "required": true, "datatypes":["integer", "long", "double", "float", "vectorudt"]},

    {"name":"mlType", "value":"Regression", "widget": "array",
    "optionsArray": ["Regression", "Classification"], "title": "MLType",
    "description": "target column type, Regression or Classification", "required": true}


  ]
}

start-details:

h2: Feature Selection With Importance Node Details

This node used Random Forest which is a very powerful model both for regression and classification. It can give its own interpretation of feature importance as well, which can be plotted and used for selecting the most informative set of features.

h4:Input Parameters
* OUTPUT STORAGE LEVEL : Keep this as DEFAULT.
* TARGETCOL : Select the target variable for which we want to explore the existence of a relationship.
* FEATURE COLUMNS : 
  - Available : A list of numeric feature columns derived from the input dataframe schema.
  - Selected : A list of columns for whom the node will compute correlational values against the TARGETCOL.
* MLTYPE : Select the type of machine learning model for the input data, choose between <b>Regression</b> or <b>Classification</b> model.

end-details:

start-examples:

h2: Feature Selection With Importance Node Example

For a given dataframe having the below housing schema:
price  | bathrms | stories| bedrooms|
Double | Double  | Double | Double  |
-------------------------------------

We can select the Target Columns as <b>price</b> and explore the correlation which exists between the target column and the feature columns of <b>bathrms</b>, <b>stories</b> and <b>bedrooms</b> for a <b>Regression</b> model.

This will yield two output sections:
- A Feature Importance table showing the correlation percentage between the target column  and the feature columns &
- Output of the input dataframe in tabular format

end-examples:
