{
  "id": 3323,
  "uuid": "bf00a949-34e4-447e-bbc8-402e3594e82e",
  "name": "01- Project Overview",
  "category": "",
  "projectId": 2461,
  "content": "<h2>Project Overview</h2><h3>Objective</h3><p>The primary goal of the CPG-On-Shelf-Availability project is to ensure that consumer packaged goods (CPG) are consistently available on retail shelves by monitoring and predicting stock levels across stores and SKUs. The project addresses the critical business problem of on-shelf availability gaps, where products may be physically present in the supply chain but not replenished on shelves in time, leading to lost sales opportunities and customer dissatisfaction.</p><p>This initiative focuses on developing analytical and predictive models that leverage inventory, replenishment, and sales data to detect potential stockouts, anticipate demand, and recommend timely corrective actions.</p><h3>Approach</h3><p>The project follows a structured data science workflow:</p><ol><li>Data Collection &amp; Integration – Gather sales, inventory, replenishment, and pipeline data at SKU-store-day granularity.</li><li>Data Preparation &amp; Cleaning – Address missing data, align timelines, and engineer meaningful features such as stockout flags, sales-to-capacity ratios, and replenishment efficiency.</li><li>Exploratory Analysis – Profile inventory patterns, stock depletion rates, replenishment cycles, and shelf utilization.</li><li>Model Training &amp; Evaluation – Develop predictive models to forecast out-of-stock risks and analyze on-shelf availability drivers.</li><li>Validation &amp; Monitoring – Assess model performance using real-world sales outcomes and set up monitoring dashboards for continuous evaluation.</li><li>Deployment &amp; Business Integration – Embed outputs into decision support tools for store managers, supply chain planners, and category managers.</li></ol><h3>Significance</h3><p>On-shelf availability is a critical KPI for retail and CPG companies, as it directly influences sales, customer loyalty, and market share. Even small stockout rates can cause substantial revenue loss and drive customers toward competitors. By predicting and preventing availability issues, the business gains a competitive edge through better service levels and supply chain agility.</p><h3>Benefits</h3><ul><li>Financial: Reduce lost sales due to stockouts and optimize inventory carrying costs.</li><li>Operational: Improve replenishment planning, warehouse allocation, and shelf stocking efficiency.</li><li>Strategic: Enhance customer satisfaction, loyalty, and long-term brand perception.</li><li>Analytical: Provide data-driven insights into demand and supply chain bottlenecks.</li></ul><h3>Expected Outcomes</h3><ul><li>Accurate stockout prediction models at SKU-store-day level.</li><li>Dashboards and alerts for proactive inventory management.</li><li>Improved replenishment planning accuracy by integrating predictions with pipeline visibility.</li><li>Reduction in out-of-stock incidents by measurable percentages (e.g., 10–15% decrease within the first six months).</li></ul>",
  "icon": "{\"icon\":\"images/icons/project-icons/Sales_forecasting.svg\",\"type\":\"svg\"}",
  "description": "A brief overview of the use case and problem statement.",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "Aug 2, 2025, 12:11:28 PM",
  "updatedBy": "rohan",
  "dateLastUpdated": "Sep 12, 2025, 10:35:36 AM"
}