{
  "id": 2024,
  "uuid": "a9112915-b147-455e-8762-9bd468add423",
  "name": "2.Data Description and Preparation",
  "category": "",
  "projectId": 1565,
  "content": "<h1>Data Description:</h1><p>This dataset corresponds to XYZ Bank's direct marketing campaign, predominantly utilizing telephone calls. Multiple contacts with the same client were made to determine their subscription preference ('yes' or 'no') for a term deposit. The classification goal is to predict customer sign-up (yes/no) for a term deposit (variable y). The dataset comprises 20 entries/columns, spanning from May 2008 to November 2010. The key features are</p><ul><li>Age: Numeric</li><li>Job: Type of job (Categorical)</li><li>Marital: Marital status (Categorical)</li><li>Education: Education level (Categorical)</li><li>Default: Has credit in default? (Categorical)</li><li>Housing: Has a housing loan? (Categorical)</li><li>Loan: Has a personal loan? (Categorical)</li><li>Contact: Contact communication type (Categorical)</li><li>Month: Last contact month of the year (Categorical)</li><li>Day_of_week: Last contact day of the week (Categorical)</li><li>Duration: Last contact duration, in seconds (Numeric)</li><li>Campaign: Number of contacts performed during this campaign and for this client (Numeric, includes the last contact)</li><li>Pdays: Number of days that passed by after the client was last contacted from a previous campaign (Numeric; 999 means the client was not previously contacted)</li><li>Previous: Number of contacts performed before this campaign and for this client (Numeric)</li><li>Poutcome: Outcome of the previous marketing campaign (Categorical)</li><li>Emp.var.rate: Employment variation rate - quarterly indicator (Numeric)</li><li>Cons.price.idx: Consumer price index - monthly indicator (Numeric)</li><li>Cons.conf.idx: Consumer confidence index - monthly indicator (Numeric)</li><li>Euribor3m: Euribor 3-month rate - daily indicator (Numeric)</li><li>Nr.employed: Number of employees - quarterly indicator (Numeric)</li></ul><p><br></p><h1>Data Preparation:</h1><ul><li><strong>Handling Null Values in 'Nr.employed':</strong></li></ul><p>The 'Nr.employed' feature exhibits a substantial 80% presence of null values. To ensure data integrity and avoid potential biases, we opt to remove this specific feature from our dataset.</p><ul><li><strong>Categorizing 'Age' into Age Groups:</strong></li></ul><p>To enhance the interpretability of the 'age' feature, we introduce a categorical transformation. We divide the age range into four distinct categories or groups, facilitating a more insightful analysis of age-related patterns in the data.</p><ul><li><strong>Scaling 'Pdays' for Binary Representation:</strong></li></ul><p>For the 'Pdays' feature, we implement a scaling strategy to convert it into a binary representation. Values of 999, signifying that a client was not previously contacted, are mapped to 0. All other values are mapped to 1, indicating contact in a previous marketing campaign. This binary representation simplifies the interpretation of the 'Pdays' feature, making it more amenable to modeling and analysis.</p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "May 5, 2025, 12:53:41 PM",
  "dateLastUpdated": "May 5, 2025, 12:53:41 PM"
}