{
  "id": 3206,
  "uuid": "334343aa-10c3-4628-924e-6a850edecd57",
  "name": "02-Dataset Definition and Preparation",
  "category": "",
  "projectId": 1607,
  "content": "<h3>&nbsp;Dataset Overview</h3><p>This dataset is designed for predicting patient risk categories (High, Moderate, Low) based on medical and demographic attributes. The classification goal is to support early detection, personalized treatment, and efficient healthcare resource allocation.</p><p><br></p><h3>Data Description</h3><p>The dataset includes the following key columns:</p><ul><li>Age: Age of the patient.</li><li>BMI: Body Mass Index (calculated from height and weight).</li><li>Blood Pressure: Includes systolic and diastolic blood pressure values.</li><li>Cholesterol Level: Measurement of cholesterol in the blood.</li><li>Blood Sugar Level: Glucose concentration in the blood.</li><li>Heart Rate: Heartbeats per minute.</li><li>Smoking Status: Indicates whether the patient is a smoker or non-smoker.</li><li>Diabetes: Indicates if the patient has diabetes (Yes/No).</li><li>Hypertension: Indicates if the patient has high blood pressure (Yes/No).</li><li>Risk_Score: Continuous numerical value representing the overall health risk score.</li><li>Risk_Category (Target Variable): Patient’s categorized risk level (High, Moderate, Low).</li></ul><h3>Data Preparation</h3><h4>1. Data Cleaning</h4><ul><li>Missing Data: Imputed or removed missing values.</li><li>Outlier Detection: Identified and handled extreme values in numerical health indicators.</li><li>Consistency Checks: Ensured uniform formatting of categorical data (e.g., \"Yes/No\" standardized).</li></ul><h4>2. Feature Engineering</h4><p>Derived additional features to enhance predictive power:</p><ul><li>Age_Group: Patient grouped into ranges (e.g., Child, Adult, Senior).</li><li>BMI_Category: Categorized as Underweight, Normal, Overweight, Obese.</li><li>Systolic_BP_Category: Classified as Normal, Elevated, Hypertension Stage 1, Stage 2.</li><li>Diastolic_BP_Category: Grouped by diastolic pressure ranges.</li><li>Cholesterol_Level_Category: Desirable, Borderline, High.</li><li>Blood_Sugar_Level_Category: Normal, Prediabetic, Diabetic.</li><li>Insulin_Level_Category: Normal, Insulin Resistant, Hyperinsulinemia.</li><li>Smoking_Status_String: Descriptive smoking habits (Smoker, Non-Smoker, Former Smoker).</li><li>Diabetes_Status_String: Describes diabetic status as a string field.</li><li>Hypertension_Status_String: Indicates hypertension status as a string field.</li><li>Heart_Disease_History_String: Captures patient’s history of cardiovascular disease.</li><li>Risk_Score_Category: Categorized version of the continuous Risk_Score.</li></ul><h4>3. Data Transformation</h4><ul><li>Encoding: Converted categorical variables (e.g., Smoking Status, Diabetes) into numerical codes for ML algorithms.</li><li>Feature Scaling: Applied standardization/normalization to ensure equal weightage across features.</li></ul><h4>4. Data Integration</h4><ul><li>Combine Data Sources: Merged multiple datasets on patient ID or unique identifiers.</li><li>Aggregate Features: Derived composite variables (e.g., Overall Cardiovascular Risk combining blood pressure + cholesterol + smoking status).</li></ul><p><br></p><p>By preparing the data in this structured manner, the dataset will be more conducive to analysis and model building, enabling more accurate Validation of patient risk categories and supporting effective healthcare decision-making.</p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "Aug 2, 2025, 12:07:09 PM",
  "updatedBy": "mudit",
  "dateLastUpdated": "Sep 22, 2025, 10:54:16 AM"
}