{
  "id": 3330,
  "uuid": "eb10f758-462f-4cd3-88e7-2ff68e71a707",
  "name": "03-Clustering",
  "category": "",
  "projectId": 2462,
  "content": "<h1>Model Training and Evaluation</h1><h3>Model Used</h3><p>For this project, K-Means Clustering was applied to segment customers based on their purchasing behavior. K-Means is an unsupervised learning algorithm that groups customers into distinct clusters by minimizing within-cluster variance. It is suitable for this problem because it helps uncover natural groupings of customers without predefined labels, enabling data-driven segmentation.</p><p><br></p><h3>Features Details</h3><p>The following features were engineered and used in clustering analysis:</p><ul><li>Total Unique Products Purchased per Customer – captures product diversity in customer purchases.</li><li>Total Number of Invoices per Customer – measures purchase frequency.</li><li>Monthly Purchase Amount per Customer – reflects customer spending patterns.</li><li>Average Purchase Amount per Invoice – indicates typical transaction value.</li><li>Average Number of Products per Invoice – provides insight into basket size.</li></ul><h3>Feature Importance</h3><p>In clustering, feature importance is inferred from how strongly each feature contributes to cluster differentiation:</p><ul><li>Spending behavior (Monthly Purchase &amp; Invoice Purchase Amount): Key drivers for identifying high-value customers.</li><li>Purchase diversity (Unique Products): Helps segment customers by product variety preference.</li><li>Purchase frequency (Invoices &amp; Products per Invoice): Highlights differences between frequent vs. occasional buyers.</li></ul><p>Normalization was applied to ensure all features contributed equally to the clustering process.</p><p><br></p><h3>Cluster Analysis</h3><p>Cluster 1</p><ul><li>High unique products (9.5), high spending (avg. monthly: 2,166,043), and high invoice value (226,090).</li><li>Interpretation: Represents high-value, diverse shoppers with strong purchasing power.</li></ul><p>Cluster 2</p><ul><li>Second-highest unique products (18.5), high invoice value (862,479), and strong monthly purchase (216,890).</li><li>Interpretation: Similar to Cluster 1 but with even more product diversity. These are premium, high-value customers.</li></ul><p>Cluster 3</p><ul><li>Moderate product variety (8.18), moderate invoices (6.09), but lowest monthly purchase (1.10).</li><li>Interpretation: Budget-conscious or occasional buyers with limited contribution to overall revenue.</li></ul><p>Cluster 4</p><ul><li>High invoice count (8.62), moderate spending (191,495), and moderate product diversity (6.37).</li><li>Interpretation: Represents frequent but moderate spenders, consistent shoppers who provide stable revenue.</li></ul><p>Cluster 0</p><ul><li>Moderate product variety (7.46), moderate spending (169,324), but highest products per invoice (2.06).</li><li>Interpretation: Customers who buy in bulk per transaction, but with overall moderate spending.</li></ul><h3>Model Metrics</h3><p>Since clustering is unsupervised, traditional accuracy metrics don’t apply. Instead, evaluation focused on:</p><ul><li>Silhouette Score: Measures cohesion and separation of clusters.</li><li>Cluster Size Distribution: Ensures meaningful segment sizes.</li><li>Business Interpretability: Clusters must align with actionable marketing insights.</li></ul><h3>Overall Summary</h3><p>The clustering results produced five distinct customer segments:</p><ul><li>Cluster 1 &amp; 2: High-value customers with strong spending and product diversity.</li><li>Cluster 4: Frequent buyers contributing consistent revenue.</li><li>Cluster 3: Low-spend, occasional buyers requiring engagement strategies.</li><li>Cluster 0: Bulk buyers who purchase more products per transaction.</li></ul><p>This segmentation provides a foundation for targeted marketing strategies, personalized recommendations, and revenue optimization.</p>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "Aug 2, 2025, 12:11:28 PM",
  "updatedBy": "rohan",
  "dateLastUpdated": "Sep 11, 2025, 12:59:32 PM"
}