{
  "id": 3364,
  "uuid": "5a5c4d72-a8b0-4cf2-a112-4d7772e7af2c",
  "name": "3. Model Selection and Training",
  "category": "",
  "projectId": 2467,
  "content": "<h3>Model Selection and Training</h3><p>Once the data is preprocessed and ready for analysis, the next phase in the customer segmentation process is selecting the appropriate machine learning model and training it to effectively discover distinct customer segments. This phase is crucial in transforming raw data into meaningful insights that guide tailored sales and marketing strategies.</p><h3>Unsupervised Learning Algorithms</h3><p>Customer segmentation in a B2B context is primarily an unsupervised learning task. Since there is no predefined target variable, the objective is to uncover natural patterns in the data.</p><p>The algorithm chosen for this project is K-means clustering, a widely used method for segmentation. K-means groups customers who exhibit similar characteristics across features such as:</p><ul><li>Purchase volume</li><li>Product mix (categories and SKUs purchased)</li><li>Purchase frequency</li><li>Geographical location</li></ul><p>The algorithm works iteratively to minimize the distance between customers within a cluster, ensuring that groups represent customers with similar buying behaviors or needs. For example, in the CPG context, K-means can group customers who consistently purchase large volumes of diapers, or those who primarily engage with wipes and tissues.</p><h3>Determining the Optimal Number of Clusters</h3><p>A critical step in clustering is deciding the optimal number of clusters:</p><ul><li>Elbow Method: Plots the variance explained against the number of clusters, with the “elbow point” indicating the point where adding more clusters provides diminishing returns.</li><li>Silhouette Analysis: Evaluates the cohesion and separation of clusters by scoring how similar each customer is to their own cluster compared to others. Scores closer to 1 indicate well-defined clusters.</li></ul><p>These methods ensure that the model produces clusters that are both statistically sound and business-meaningful.</p><h3>Training the Model</h3><p>With the optimal number of clusters defined, the K-means model is trained iteratively:</p><ol><li>Initialize Centroids – Randomly assign starting points for clusters.</li><li>Assign Customers – Allocate each customer to the nearest centroid based on feature similarity.</li><li>Recalculate Centroids – Update centroid positions based on assigned customers.</li><li>Iterate Until Convergence – Repeat steps until customer assignments stabilize.</li></ol><p>During training, the model automatically optimizes cluster assignments by considering:</p><ul><li>Total purchase value (Customer Lifetime Value)</li><li>Frequency of purchases</li><li>Discount utilization</li><li>Product category preferences</li><li>Geographic distribution</li></ul><p>The resulting customer segments represent distinct groups with shared behaviors. Example segments might include:</p><ul><li>High-volume buyers – Customers driving majority of revenue.</li><li>Category-focused buyers – Customers with strong product affinities (e.g., diapers vs wipes).</li><li>Discount-sensitive buyers – Customers highly influenced by promotional offers.</li><li>Frequent but low-value buyers – Regular purchasers with smaller order sizes.</li><li>These segments enable tailored sales and marketing strategies, ensuring that each customer type is addressed according to their unique business needs.</li></ul>",
  "icon": "{\"type\":\"svg\",\"icon\":\"images/createApplications.svg\"}",
  "description": "",
  "syncedWithGithub": false,
  "createdBy": "admin",
  "dateCreated": "Aug 2, 2025, 12:11:33 PM",
  "updatedBy": "rohan",
  "dateLastUpdated": "Sep 12, 2025, 7:44:21 AM"
}